Repository: monero-ecosystem/monero-translations
Catalog: translation-memories/nl/TM_Monero_NL-NL.tmx
Source language: en_us
Languages: nl_nl

source: Until [#498](https://github.com/monero-project/kovri/issues/498) is resolved, consider only registering your service with Kovri and *not* stats.i2p!**
nl_nl: Registreer uw service liever alleen bij Kovri en *niet* bij stats.i2p totdat issue [#498](https://github.com/monero-project/kovri/issues/498) is opgelost.**

source: - Open a request with `[Subscription Request] your-host.i2p` (replace your-host.i2p with your desired hostname) on the [Kovri issue tracker](https://github.com/monero-project/kovri/issues)
nl_nl: - Open een verzoek met de tekst `[Subscription Request] mijnhost.i2p` (vervang `mijnhost.i2p door de gewenste hostname) in de [Kovri-issuetracker](https://github.com/monero-project/kovri/issues).

source: - In the request body, paste the contents of your public `.txt` file that was mentioned in the previous step
nl_nl: - Plak in de hoofdtekst van het verzoek de inhoud van het in de vorige stap genoemde openbare `.txt`-bestand.

source: - After review, we will add your host and sign the subscription
nl_nl: - Nadat uw host is goedgekeurd, wordt uw host toegevoegd en wordt het abonnement ondertekend.

source: - Done!
nl_nl: - Klaar is Kees!

source: Run Kovri
nl_nl: Voer Kovri uit

source: - Wait 5 minutes or so to get bootstrapped into the network before attempting to use services
nl_nl: - Wacht ongeveer 5 minuten totdat uw host wordt herkend door het netwerk voordat u probeert services te gebruiken.

source: For files containing only new work, run [clang-format](http://clang.llvm.org/docs/ClangFormat.html) with ```-style=file``` (which uses our provided [.clang-format](https://github.com/monero-project/kovri/blob/master/.clang-format))
nl_nl: Voer voor bestanden met alleen nieuw werk [clang-format](http://clang.llvm.org/docs/ClangFormat.html) uit met ```-style=file```. Daardoor wordt ons [.clang-format](https://github.com/monero-project/kovri/blob/master/.clang-format) gebruikt.

source: Join us on IRC
nl_nl: Chat met ons via IRC.

source: Startup your [IRC client](https://en.wikipedia.org/wiki/List_of_IRC_clients)
nl_nl: Start uw [IRC client](https://nl.wikipedia.org/wiki/Internet_Relay_Chat#Clients).

source: Setup your client to connect to kovri's IRC port (default 6669).
nl_nl: Stel uw client in om verbinding te maken met de IRC-poort voor kovri (standaard 6669).

source: This will connect you to the Irc2P network (I2P's IRC network)
nl_nl: Zo maakt u verbinding met het Irc2P-netwerk (het IRC-netwerk van I2P).

source: Join `#kovri` and `#kovri-dev`
nl_nl: Open de kanalen `#kovri` en `#kovri-dev`.

source: Browse an I2P website (garlic-site/eepsite)
nl_nl: Bezoek een I2P-website (garlic-site/eepsite)

source: Startup a browser of your choosing (preferably a browser devoted to kovri usage)
nl_nl: Start een browser naar keuze (liefst een browser die u alleen voor kovri gebruikt).

source: For files with mixed (existing + new) work, run [clang-format](http://clang.llvm.org/docs/ClangFormat.html) selectively over only lines directly related to the new work.
nl_nl: Voor bestanden met zowel nieuw als bestaand werk voert u [clang-format](http://clang.llvm.org/docs/ClangFormat.html) selectief uit voor alleen regels met nieuw werk.

source: - See [vim](http://clang.llvm.org/docs/ClangFormat.html#vim-integration) and [emacs](http://clang.llvm.org/docs/ClangFormat.html#emacs-integration) documentation for examples of configuring keybindings for `clang-format` plugins.
nl_nl: - Zie de documentatie van [vim](http://clang.llvm.org/docs/ClangFormat.html#vim-integration) en [emacs](http://clang.llvm.org/docs/ClangFormat.html#emacs-integration) voor voorbeelden van het configureren van sneltoetsen voor `clang-format`-plug-ins.

source: Configure your browser by reading [these instructions](https://geti2p.net/en/about/browser-config) **but instead of port 4444 and 4445** change HTTP proxy port to **4446** and SSL proxy port *also* to **4446**
nl_nl: Configureer uw browser door [deze instructies](https://geti2p.net/en/about/browser-config) te lezen, maar **in plaats van poort 4444 en 4445** verandert u de HTTP-proxypoort in **4446** en verandert u de SSL-proxypoort *ook* in **4446**.

source: Visit http://check.kovri.i2p
nl_nl: Ga naar http://check.kovri.i2p

source: Notes:
nl_nl: Opmerkingen:

source: - SSL site support and outproxy service is not currently implemented
nl_nl: - Er worden momenteel geen SSL-sites of outproxy-services ondersteund.

source: - If someone gives you a .i2p address that's not in your address book, use the `Jump` service at http://stats.i2p/i2p/lookup.html
nl_nl: - Als iemand u een .i2p-adres geeft dat niet in uw adresboek staat, gebruikt u de `Jump`-service op http://stats.i2p/i2p/lookup.html.

source: - Look through hosts.txt in your data directory to view a list of default sites you can easily visit
nl_nl: - Raadpleeg het bestand hosts.txt in uw gegevensdirectory voor een lijst met standaardsites die u kunt bezoeken.

source: - Overall, HTTP Proxy and address book implementation are in development and not yet feature-complete
nl_nl: - De implementatie van de HTTP-proxy en het adresboek is nog in ontwikkeling en er ontbreken nog functies.

source: Enjoy!
nl_nl: Veel plezier met Kovri!

source: - Read more about Kovri in the [Moneropedia](https://getmonero.org/resources/moneropedia/kovri).
nl_nl: - Lees meer over Kovri in de [Moneropedia](https://getmonero.org/resources/moneropedia/kovri).

source: - Open your feature requests or report bugs on our [issues tracker](https://github.com/monero-project/kovri/issues)
nl_nl: - Open functieverzoeken of meld bugs via onze [issuetracker](https://github.com/monero-project/kovri/issues).

source: - Learn more about the I2P network on the [java I2P website](https://geti2p.net/en/docs)
nl_nl: - Lees meer over het I2P-netwerk op de [Java I2P-website](https://geti2p.net/en/docs).

source: # Container Options
nl_nl: # Containeropties

source: On Linux systems, use snapcraft for easy deployment.
nl_nl: Op Linux-systemen kunt u snapcraft gebruiken om Kovri eenvoudig te installeren.

source: Get the Kovri source repo
nl_nl: Kopieer de repository met de Kovri-broncode

source: - Refer to your distribution's package manager for snapcraft and [snapd](https://snapcraft.io/docs/core/install)
nl_nl: - Gebruik de packagemanager van uw distributie voor snapcraft en [snapd](https://snapcraft.io/docs/core/install).

source: On Ubuntu, simple run:
nl_nl: In Ubuntu voert u simpelweg het volgende uit:

source: Run Kovri with snapcraft
nl_nl: Voer Kovri uit met snapcraft

source: Installing Docker is outside the scope of this document, please see the [docker documentation](https://docs.docker.com/engine/installation/)
nl_nl: Het installeren van Docker valt buiten het bereik van dit document. Zie daarvoor de [Docker-documentatie](https://docs.docker.com/engine/installation/).

source: Configuring / Open Firewall
nl_nl: Configureren/firewall openstellen

source: The docker image comes with the defaults of kovri, but can be configured as explained in earlier sections.
nl_nl: De Docker-image wordt geleverd met de standaardinstellingen van kovri, maar kan worden geconfigureerd, zoals hierboven uitgelegd.

source: You should choose a random port and open that port (see earlier sections).
nl_nl: Kies een willekeurige poort en zet die poort open (zie hierboven).

source: #### Default Settings
nl_nl: #### Standaardinstellingen

source: #### Custom Settings
nl_nl: #### Aangepaste instellingen

source: Where `./kovri-settings/` contains `kovri.conf` and `tunnels.conf`.
nl_nl: Hierbij bevat `./kovri-settings/` de configuratiebestanden `kovri.conf` en `tunnels.conf`.

source: To do so, uncomment or create `keys = your-keys.dat` and replace `your-keys` with an appropriate name.
nl_nl: Voeg daarvoor `keys = mijnsleutels.dat` toe, of haal de commentaartekens voor die regel weg, en vervang `mijnsleutels` door een geschikte naam.

source: `client/keys/your-keys.dat`
nl_nl: `client/keys/mijnsleutels.dat`

source: `client/keys/your-keys.dat.txt`
nl_nl: `client/keys/mijnsleutels.dat.txt`

source: # So, you've installed Kovri.
nl_nl: # Dus u heeft Kovri geïnstalleerd.

source: Poke a hole in your NAT/Firewall to allow incoming TCP/UDP connections to that port (See notes below if you don't have access)
nl_nl: Geef in de NAT/firewall toestemming voor die poort aan inkomende TCP/UDP-verbindingen. (Zie onderstaande opmerkingen als u geen toegang heeft).

source: - If you do not have access to your NAT, see instructions in the [building guide](https://github.com/monero-project/kovri-docs/blob/master/i18n/en/building.md) for your OS.
nl_nl: - Raadpleeg de instructies in de [handleiding voor opbouwen](https://github.com/monero-project/kovri-docs/blob/master/i18n/en/building.md) voor uw besturingssysteem als u geen toegang heeft tot uw NAT.

source: - After installing the appropriate resources in your kovri data path, considering setting appropriate access control with [setfacl](https://linux.die.net/man/1/setfacl), [umask](https://en.wikipedia.org/wiki/Umask), or whatever your OS uses for ACL
nl_nl: - Nadat u de benodigde resources heeft geïnstalleerd in uw gevenspad voor kovri, kunt u er toegangsbeheer voor instellen met [setfacl](https://linux.die.net/man/1/setfacl), [umask](https://en.wikipedia.org/wiki/Umask) of de toegangsbeheerfunctie van uw besturingssysteem.

source: - **Just like with Tor, one doesn't need SSL to safely and securely use the network**
nl_nl: - ** Net als met Tor heeft u geen SSL nodig om het netwerk veilig te gebruiken.**

source: Note: the --dangerous flag is needed only because the snap has not been signed (you built it yourself though, so this shouldn't be an issue)
nl_nl: Opmerking: de parameter --dangerous is alleen nodig omdat de snap niet is ondertekend. Maar dat is geen probleem, want u heeft de snap immers zelf gemaakt.

source: * Download the [MSYS2 installer](http://msys2.github.io/), 64-bit or 32-bit as needed, and run it.
nl_nl: * Download het [MSYS2-installatieprogramma](http://msys2.github.io/) in de versie die u nodig heeft, 64-bits of 32-bits, en voer het uit.

source: Note that if you are running 64-bit Windows, you will have both 64-bit and 32-bit environments.
nl_nl: Op een 64-bits versie van Windows heeft u zowel een 64-bits als een 32-bits omgeving.

source: ```mingw-w64-x86_64-doxygen``` (you'll need [Graphviz](http://graphviz.org/doc/winbuild.html) for doxygen)
nl_nl: ```mingw-w64-x86_64-doxygen``` (voor doxygen heeft u [Graphviz](http://graphviz.org/doc/winbuild.html) nodig)

source: You'll need ``` mingw-w64-x86_64-miniupnpc``` if you are behind a restrictive NAT firewall.
nl_nl: U moet ``` mingw-w64-x86_64-miniupnpc``` opgeven als u achter een NAT-firewall met beperkingen zit.

source: "LibFuzzer is under active development so you will need the current (or at least a very recent) version of the Clang compiler"
nl_nl: "LibFuzzer wordt actief ontwikkeld, dus u heeft de huidige (of tenminste een recente) versie van de compiler Clang nodig."
